In [1]:
import numpy as np
import pandas as pd

In [2]:
!pip install Faker

Requirement already satisfied: Faker in c:\users\user\anaconda3\lib\site-packages (0.9.1)
Requirement already satisfied: python-dateutil>=2.4 in c:\users\user\anaconda3\lib\site-packages (from Faker) (2.7.5)
Requirement already satisfied: text-unidecode==1.2 in c:\users\user\anaconda3\lib\site-packages (from Faker) (1.2)
Requirement already satisfied: six>=1.10 in c:\users\user\anaconda3\lib\site-packages (from Faker) (1.14.0)

In [3]:
from faker import Faker

In [4]:
## Start creating a Fake Dataset

fake_data = Faker()

In [5]:
# Let's create a list of 200 fake names first
def create_names(n):
    name = []
    for _ in range(0, n):
        name.append(fake_data.name())
    return name

In [8]:
name = create_names(50) ## To create 50 fake names.
name[:5]

['Heidi Edwards',
 'Gabriella Drake',
 'Michele Bryant',
 'Emily Wilson',
 'Amber Russell']

In [9]:
## Successfully created Fake Names

In [10]:
# Create a list of countries
def create_country(n):
    nation = []
    for _ in range(0, n):
        nation.append(fake_data.country())
    return nation

In [11]:
country = create_country(200)

In [12]:
country[:4]

['United Arab Emirates', 'Saint Kitts and Nevis', 'Ethiopia', 'Serbia']

In [13]:
# Now suppose we need to create a list of age wherein we want to create 200 ages of people, all being random integers.
# The limitation being the minimum age should be 21 and max should be less than 98.

# Create a list of age from 21 to 98 (integers)
age = np.random.randint(21, 99, size = 200, dtype = 'int')

In [14]:
# Create a list fo fake dates
def create_date(n):
    member_since = []
    for _ in range(0, n):
        member_since.append(fake_data.date_this_century())
    return member_since

In [15]:
date = create_date(200)

In [16]:
# Create a list of fake jobs
def create_job(n):
    job = []
    for _ in range(0, n):
        job.append(fake_data.job())
    return job

In [17]:
occupation = create_job(200)

In [18]:
# Create a list of fake credit card types
def create_credit(n):
    card = []
    for _ in range(0, n):
        card.append(fake_data.credit_card_provider())
    return card

In [19]:
card = create_credit(200)

In [29]:
# Create a list of values 0 and 1, where 1 = married
married = np.random.randint(0,2, size = 200)

In [30]:
# Create a list of randomly picked races from the list of 4 races
def create_race(n):
    race = []
    for _ in range(0, n):
        race.append(fake_data.random_element(elements = ("White", "Hispanic", "Black", "Asian")))
    return race

In [31]:
races = create_race(200)

In [32]:
# Now create 3 list of integers just to have some numerical data
salary = np.random.randint(10000, 120000, size = 200, dtype = 'int')
savings = np.random.randint(0, 50000, size = 200, dtype = 'int')
rent = np.random.randint(500, 3001, size = 200, dtype = 'int')

In [39]:
# Now, connect all columns into one data set
data1 = pd.DataFrame(list(zip(name, country, age, date, occupation, card, married,
                            races, salary, savings, rent)),
                   columns = ['Name', 'Place_of_Birth', 'Age', 'Member_Since', 'Job',
                              'Card',  'Married', 'Race', 'Salary', 'Savings',
                              'Rent'])

In [40]:
# Let's see how the data looks like
data1.head()

,Name,Place_of_Birth,Age,Member_Since,Job,Card,Married,Race,Salary,Savings,Rent
0,Heidi Edwards,United Arab Emirates,29,2016-06-02,Analytical chemist,VISA 13 digit,0,Black,90534,47526,2685
1,Gabriella Drake,Saint Kitts and Nevis,67,2009-01-08,Race relations officer,Mastercard,1,Hispanic,29929,948,2231
2,Michele Bryant,Ethiopia,30,2011-09-30,Hydrographic surveyor,VISA 13 digit,1,Hispanic,84875,11639,1011
3,Emily Wilson,Serbia,28,2011-10-13,Neurosurgeon,VISA 16 digit,1,Asian,109418,5762,1211
4,Amber Russell,Trinidad and Tobago,87,2011-01-22,Clinical research associate,JCB 16 digit,1,Asian,46080,12040,2402

In [41]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            50 non-null     object
 1   Place_of_Birth  50 non-null     object
 2   Age             50 non-null     int64
 3   Member_Since    50 non-null     object
 4   Job             50 non-null     object
 5   Card            50 non-null     object
 6   Married         50 non-null     int64
 7   Race            50 non-null     object
 8   Salary          50 non-null     int64
 9   Savings         50 non-null     int64
 10  Rent            50 non-null     int64
dtypes: int64(5), object(6)
memory usage: 4.4+ KB

In [42]:
# Perfect, let's create another set based on time
datelist = pd.date_range('2010-01-01', periods = 200)
sales = np.random.randint(100, 1100, size = 200, dtype = 'int')
profit = np.random.uniform(10000, 1000000, size = 200)

data2 = pd.DataFrame(list(zip(datelist, sales, profit)),
                   columns = ['Date', 'Sales', 'Profit'])

In [43]:
data2.head()

        Date  Sales         Profit
0 2010-01-01    734  223963.253902
1 2010-01-02    546   16790.909559
2 2010-01-03    127  334246.614199
3 2010-01-04    345  106082.684556
4 2010-01-05    722  996558.434547

In [46]:
df = pd.concat([data1,data2],1)

In [47]:
df.head()

,Name,Place_of_Birth,Age,Member_Since,Job,Card,Married,Race,Salary,Savings,Rent,Date,Sales,Profit
0,Heidi Edwards,United Arab Emirates,29.0,2016-06-02,Analytical chemist,VISA 13 digit,0.0,Black,90534.0,47526.0,2685.0,2010-01-01,734,223963.253902
1,Gabriella Drake,Saint Kitts and Nevis,67.0,2009-01-08,Race relations officer,Mastercard,1.0,Hispanic,29929.0,948.0,2231.0,2010-01-02,546,16790.909559
2,Michele Bryant,Ethiopia,30.0,2011-09-30,Hydrographic surveyor,VISA 13 digit,1.0,Hispanic,84875.0,11639.0,1011.0,2010-01-03,127,334246.614199
3,Emily Wilson,Serbia,28.0,2011-10-13,Neurosurgeon,VISA 16 digit,1.0,Asian,109418.0,5762.0,1211.0,2010-01-04,345,106082.684556
4,Amber Russell,Trinidad and Tobago,87.0,2011-01-22,Clinical research associate,JCB 16 digit,1.0,Asian,46080.0,12040.0,2402.0,2010-01-05,722,996558.434547

In [48]:
df.to_csv('Fake_Income_Card_History_for_Regression')